src/Reports/СертификатыНоменклатурыСИстекающимСрокомДействия/СертификатыНоменклатурыСИстекающимСрокомДействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СертификатыНоменклатурыСИстекающимСрокомДействия</name>
</mdclass:Report>

src/Catalogs/СертификатыНоменклатуры/СертификатыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СертификатыНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УДАЛИТЬСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСрокаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдавшийДокумент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСертификатовНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/СертификатыНоменклатурыСИстекающимСрокомДействия/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек = Истина;
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//
// Подробнее - см. ОтчетыПереопределяемый.ПослеЗаполненияПанелиБыстрыхНастроек
//
Процедура ПослеЗаполненияПанелиБыстрыхНастроек(ЭтаФорма, ПараметрыЗаполнения) Экспорт
	
	ПолеТипСертификата = ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы[0];
	ПолеКомпоновкиДанныхТипСертификата = ПолеТипСертификата.Варианты.Элементы[0].Отбор.Элементы[0].ЛевоеЗначение;
	ПолеТипСертификата.Варианты.Элементы.Очистить();
	
	МассивТиповСертификатов = Справочники.СертификатыНоменклатуры.СформироватьСписокВыбораТиповСертификатов();	
	
	Для Каждого ТипСертификата Из МассивТиповСертификатов Цикл
		
		ВариантКомпановкиДанных = ПолеТипСертификата.Варианты.Элементы.Добавить();
		ВариантКомпановкиДанных.Использование = Истина;
		ВариантКомпановкиДанных.Значение = ТипСертификата;
		ВариантКомпановкиДанных.Представление = ТипСертификата;

		ЭлементОтбора = ВариантКомпановкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = ПолеКомпоновкиДанныхТипСертификата;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Содержит;
		ЭлементОтбора.ПравоеЗначение = ТипСертификата;
				
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
